Revit 2026 API

# Path3dNumCurveLoops Property

---

Get the Number of Curve Loops of Path3d.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int NumCurveLoops { get; }
```
```vb
Public ReadOnly Property NumCurveLoops As Integer
	Get
```
```cpp
public:
property int NumCurveLoops {
	int get ();
}
```
```fsharp
member NumCurveLoops : int with get
```

#### Property Value

Int32

Returns the Number of Curve Loops of Path3d.

#### Reference

Path3d Class

Autodesk.Revit.DB Namespace